Revit 2027 API
AnalysisDisplayLegendSettings.NumberForScale Property
 A fixed value to display on the legend scale (0 by default; 0 means width of legend scale is calculated dynamically).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NumberForScale { get; set; }
Public Property NumberForScale As Double
	Get
	Set
public:
property double NumberForScale {
	double get ();
	void set (double value);
}
member NumberForScale : float with get, set
Property Value
Double
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace